### Terraform `plan` result
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-   destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.cpf_clients.aws_iot_thing.client["26"] must be replaced
-/+ resource "aws_iot_thing" "client" {
!       arn               = "arn:aws:iot:ap-northeast-1:634518058314:thing/dev_bxd_0002" -> (known after apply)
!       attributes        = {
-           "certName"   = "9e030bba9c3d751b963e632e4d9064c1d021ba97dfab8b37f238bf0cf03b6252"
-           "deviceId"   = "did-B68E97BCB4B3CF0ED887F991DD35FA7878309306"
-           "deviceType" = "Wayna"
        } -> (known after apply)
!       default_client_id = "dev_bxd_0002" -> (known after apply)
!       id                = "dev_bxd_0002" -> (known after apply)
!       name              = "dev_bxd_0002" -> "dev_bxd_0003" # forces replacement
!       version           = 3 -> (known after apply)
    }

  # module.cpf_clients.aws_iot_thing_principal_attachment.client["26"] must be replaced
-/+ resource "aws_iot_thing_principal_attachment" "client" {
!       id        = "dev_bxd_0002|arn:aws:iot:ap-northeast-1:634518058314:cert/9e030bba9c3d751b963e632e4d9064c1d021ba97dfab8b37f238bf0cf03b6252" -> (known after apply)
!       thing     = "dev_bxd_0002" -> "dev_bxd_0003" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.cpf_clients.aws_s3_bucket_object.client_file["26"] must be replaced
-/+ resource "aws_s3_bucket_object" "client_file" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "b1572071c46f8837ca12762f44f50b1c" -> (known after apply)
!       id                     = "dev_bxd_0002.zip" -> (known after apply)
!       key                    = "dev_bxd_0002.zip" -> "dev_bxd_0003.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/tmp/dev_bxd_0002.zip" -> "./.terraform/tmp/dev_bxd_0003.zip"
!       storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "1Ud0WV6v_FrutYvYqsP1_8WwegIfhRpt" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 10 to destroy.
```

</details>